AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32f446xx.h"
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include "config/app_motor_test_config.h"
#include "config/project_config.h"
#include "drivers/as5600_analog.h"
#include "board/board.h"
#include "drivers/adc.h"
#include "drivers/log.h"
#include "motor/motor.h"
#include "motor/motor_3pwm.h"
#include "motor/motor_electrical_angle.h"
#include "motor/motor_foc_voltage.h"
#include "motor/motor_openloop.h"
#include "motor/motor_speed_feedback.h"
#include "motor/motor_speed_pi.h"
#include "motor/motor_speed_reference_estimator.h"

extern usart2_handle_t USART2_H;

#define APP_FAULT_REASON_SPEED_ERROR_ABS_LIMIT    1u

typedef enum app_speed_profile_phase_t {
	APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START = 0,
	APP_SPEED_PROFILE_PHASE_RAMP_UP,
	APP_SPEED_PROFILE_PHASE_PEAK_HOLD,
	APP_SPEED_PROFILE_PHASE_RAMP_DOWN,
	APP_SPEED_PROFILE_PHASE_ZERO_HOLD_END,
} app_speed_profile_phase_t;

typedef struct app_context_t {
	motor_handle_t motor_h;
	motor_3pwm_handle_t motor_3pwm_h;
	motor_openloop_handle_t motor_openloop_h;
	motor_foc_voltage_handle_t motor_foc_voltage_h;
	motor_electrical_angle_handle_t motor_electrical_angle_h;
	motor_speed_feedback_handle_t motor_speed_feedback_h;
	motor_speed_pi_handle_t motor_speed_pi_h;
	motor_speed_reference_estimator_handle_t motor_speed_reference_estimator_h;
	as5600_analog_handle_t as5600_analog_h;
	uint32_t last_telemetry_ms;
	uint32_t last_actuation_update_ms;
	uint32_t last_speed_pi_update_ms;
	uint32_t alignment_start_ms;
	int16_t applied_uq_command_permyriad;
	int32_t speed_control_target_mechanical_speed_mrpm;
	int32_t current_speed_control_reference_mrpm;
	app_speed_profile_phase_t speed_profile_phase;
	uint32_t speed_profile_phase_start_ms;
	uint16_t latest_logged_mechanical_angle_u16;
	bool latest_sample_valid;
	bool alignment_done;
} app_context_t;

int __io_putchar(int ch)
{
    uint8_t c = (uint8_t)ch;
    size_t w = usart2_write(&USART2_H, &c, 1u);

    return (w == 1u) ? ch : EOF;
}

/**
 * @brief Trap on one fatal application error before runtime drive is active.
 *
 * @param tag Log tag.
 * @param msg Log message.
 */
static void app_fatal_trap(const char *tag, const char *msg)
{
	LOGE(tag, msg);
	while(1) {}
}

/**
 * @brief Stop the powered test path and trap on one fatal runtime error.
 *
 * @param app Pointer to application runtime context.
 * @param tag Log tag.
 * @param msg Log message.
 */
static void app_fatal_stop(app_context_t *app, const char *tag, const char *msg)
{
	/* Disable the power stage before trapping on a runtime fault. */
	gpio_write(MOTOR_EN.pin, false);
	app->motor_h.status.is_enabled = false;
	(void)motor_3pwm_stop(&app->motor_3pwm_h);
	LOGE(tag, msg);
	while(1) {}
}

/**
 * @brief Build the shared motor runtime state for the current test.
 *
 * @return Initialized shared motor runtime container.
 */
static motor_handle_t app_build_motor_handle(void)
{
	motor_handle_t motor_h = {
			.measurements = {0},
			.targets = {
					.target_mechanical_speed_mrpm = APP_MOTOR_TEST_STARTUP_OPENLOOP_TARGET_MECHANICAL_SPEED_MRPM,
					.target_amplitude_permyriad = APP_MOTOR_TEST_ALIGNMENT_AMPLITUDE_PERMYRIAD,
			},
			.limits = {
					.pole_pairs = APP_MOTOR_TEST_POLE_PAIRS,
					.max_target_mechanical_speed_mrpm = 0,
					.max_amplitude_permyriad = APP_MOTOR_TEST_MAX_AMPLITUDE_PERMYRIAD,
			},
			.status = {
					.mode = MOTOR_MODE_INACTIVE,
					.is_initialized = false,
					.is_enabled = false,
					.has_valid_mechanical_angle = false,
					.has_valid_electrical_angle = false,
					.has_valid_mechanical_speed = false,
			},
			.openloop = {0},
			.speed_pi = {0},
	};

	return motor_h;
}

/**
 * @brief Initialize the application runtime context.
 *
 * @param app Pointer to application runtime context.
 */
static void app_init_context(app_context_t *app)
{
	app->motor_h = app_build_motor_handle();
	app->motor_3pwm_h = (motor_3pwm_handle_t){0};
	app->motor_openloop_h = (motor_openloop_handle_t){0};
	app->motor_foc_voltage_h = (motor_foc_voltage_handle_t){0};
	app->motor_electrical_angle_h = (motor_electrical_angle_handle_t){0};
	app->motor_speed_feedback_h = (motor_speed_feedback_handle_t){0};
	app->motor_speed_pi_h = (motor_speed_pi_handle_t){0};
	app->motor_speed_reference_estimator_h = (motor_speed_reference_estimator_handle_t){0};
	app->as5600_analog_h = (as5600_analog_handle_t){0};
	app->last_telemetry_ms = 0u;
	app->last_actuation_update_ms = 0u;
	app->last_speed_pi_update_ms = 0u;
	app->alignment_start_ms = 0u;
	app->applied_uq_command_permyriad = 0u;
	/* Keep final target field as the profile peak for telemetry and fault arming semantics. */
	app->speed_control_target_mechanical_speed_mrpm =
			APP_MOTOR_TEST_SPEED_PROFILE_PEAK_MECHANICAL_SPEED_MRPM;
	app->current_speed_control_reference_mrpm = 0;
	app->speed_profile_phase = APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START;
	app->speed_profile_phase_start_ms = 0u;
	app->latest_logged_mechanical_angle_u16 = 0u;
	app->latest_sample_valid = false;
	app->alignment_done = false;
}

/**
 * @brief Return absolute value of one signed 32-bit value.
 *
 * @param value Signed value.
 * @return Absolute value.
 */
static int32_t app_abs_i32(int32_t value)
{
	if (value < 0)
	{
		return -value;
	}

	return value;
}

/**
 * @brief Return ramp duration for the profile slope in milliseconds.
 *
 * @return Ramp duration in milliseconds.
 */
static uint32_t app_speed_profile_ramp_duration_ms(void)
{
	int64_t ramp_duration_num = 0;
	uint32_t ramp_duration_ms = 1u;

	/* ramp_ms = peak_mrpm * 1000 / accel_mrpm_per_s, rounded up. */
	ramp_duration_num =
			(int64_t)APP_MOTOR_TEST_SPEED_PROFILE_PEAK_MECHANICAL_SPEED_MRPM * 1000LL;
	ramp_duration_ms =
			(uint32_t)((ramp_duration_num +
						(int64_t)APP_MOTOR_TEST_SPEED_PROFILE_ACCELERATION_MRPM_PER_S - 1LL) /
					   (int64_t)APP_MOTOR_TEST_SPEED_PROFILE_ACCELERATION_MRPM_PER_S);
	if (ramp_duration_ms < 1u)
	{
		ramp_duration_ms = 1u;
	}

