AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
	return ramp_duration_ms;
}

/**
 * @brief Return one profile phase duration in milliseconds.
 *
 * @param phase Profile phase.
 * @return Phase duration in milliseconds.
 */
static uint32_t app_speed_profile_phase_duration_ms(app_speed_profile_phase_t phase)
{
	if (phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START)
	{
		return APP_MOTOR_TEST_SPEED_PROFILE_ZERO_HOLD_MS;
	}
	if (phase == APP_SPEED_PROFILE_PHASE_RAMP_UP)
	{
		return app_speed_profile_ramp_duration_ms();
	}
	if (phase == APP_SPEED_PROFILE_PHASE_PEAK_HOLD)
	{
		return APP_MOTOR_TEST_SPEED_PROFILE_PEAK_HOLD_MS;
	}
	if (phase == APP_SPEED_PROFILE_PHASE_RAMP_DOWN)
	{
		return app_speed_profile_ramp_duration_ms();
	}

	return APP_MOTOR_TEST_SPEED_PROFILE_ZERO_HOLD_MS;
}

/**
 * @brief Return one phase-local speed reference for elapsed phase time.
 *
 * @param phase Profile phase.
 * @param elapsed_phase_ms Elapsed time inside the active phase.
 * @return Profile speed reference in mrpm.
 */
static int32_t app_speed_profile_phase_reference_mrpm(app_speed_profile_phase_t phase,
													   uint32_t elapsed_phase_ms)
{
	int64_t ramp_delta_num = 0;
	int32_t ramp_delta_mrpm = 0;
	int32_t peak_mrpm = APP_MOTOR_TEST_SPEED_PROFILE_PEAK_MECHANICAL_SPEED_MRPM;

	if ((phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START) ||
		(phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_END))
	{
		return 0;
	}

	if (phase == APP_SPEED_PROFILE_PHASE_PEAK_HOLD)
	{
		return peak_mrpm;
	}

	/* ramp_delta_mrpm = accel_mrpm_per_s * elapsed_ms / 1000. */
	ramp_delta_num =
			(int64_t)APP_MOTOR_TEST_SPEED_PROFILE_ACCELERATION_MRPM_PER_S *
			(int64_t)elapsed_phase_ms;
	ramp_delta_mrpm = (int32_t)(ramp_delta_num / 1000LL);

	if (phase == APP_SPEED_PROFILE_PHASE_RAMP_UP)
	{
		if (ramp_delta_mrpm > peak_mrpm)
		{
			ramp_delta_mrpm = peak_mrpm;
		}
		return ramp_delta_mrpm;
	}

	if (ramp_delta_mrpm > peak_mrpm)
	{
		ramp_delta_mrpm = peak_mrpm;
	}
	return peak_mrpm - ramp_delta_mrpm;
}

/**
 * @brief Return the active profile phase target for telemetry.
 *
 * @param phase Profile phase.
 * @return Phase target in mrpm.
 */
static int32_t app_speed_profile_phase_target_mrpm(app_speed_profile_phase_t phase)
{
	if ((phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START) ||
		(phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_END))
	{
		return 0;
	}

	return APP_MOTOR_TEST_SPEED_PROFILE_PEAK_MECHANICAL_SPEED_MRPM;
}

/**
 * @brief Advance one profile phase in cyclic order.
 *
 * @param phase Current profile phase.
 * @return Next profile phase.
 */
static app_speed_profile_phase_t app_speed_profile_next_phase(app_speed_profile_phase_t phase)
{
	if (phase == APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START)
	{
		return APP_SPEED_PROFILE_PHASE_RAMP_UP;
	}
	if (phase == APP_SPEED_PROFILE_PHASE_RAMP_UP)
	{
		return APP_SPEED_PROFILE_PHASE_PEAK_HOLD;
	}
	if (phase == APP_SPEED_PROFILE_PHASE_PEAK_HOLD)
	{
		return APP_SPEED_PROFILE_PHASE_RAMP_DOWN;
	}
	if (phase == APP_SPEED_PROFILE_PHASE_RAMP_DOWN)
	{
		return APP_SPEED_PROFILE_PHASE_ZERO_HOLD_END;
	}

	return APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START;
}

/**
 * @brief Reset the unidirectional tuning profile at one runtime timestamp.
 *
 * @param app Pointer to application runtime context.
 * @param now_ms Current time in milliseconds.
 */
static void app_speed_profile_reset(app_context_t *app, uint32_t now_ms)
{
	if (app == NULL) return;

	app->speed_profile_phase = APP_SPEED_PROFILE_PHASE_ZERO_HOLD_START;
	app->speed_profile_phase_start_ms = now_ms;
	app->current_speed_control_reference_mrpm = 0;
}

/**
 * @brief Update the unidirectional trapezoidal speed profile state.
 *
 * @param app Pointer to application runtime context.
 * @param now_ms Current time in milliseconds.
 */
static void app_speed_profile_update(app_context_t *app, uint32_t now_ms)
{
	uint32_t phase_duration_ms = 0u;
	uint32_t elapsed_phase_ms = 0u;

	if (app == NULL) return;

	/* Advance phase timing before evaluating the current phase reference. */
	while (1)
	{
		phase_duration_ms = app_speed_profile_phase_duration_ms(app->speed_profile_phase);
		elapsed_phase_ms = now_ms - app->speed_profile_phase_start_ms;
		if (elapsed_phase_ms < phase_duration_ms)
		{
			break;
		}

		app->speed_profile_phase_start_ms += phase_duration_ms;
		app->speed_profile_phase = app_speed_profile_next_phase(app->speed_profile_phase);
	}

	elapsed_phase_ms = now_ms - app->speed_profile_phase_start_ms;
	app->current_speed_control_reference_mrpm =
			app_speed_profile_phase_reference_mrpm(app->speed_profile_phase, elapsed_phase_ms);
}

/**
 * @brief Check if the runtime speed-error fault trigger is armed.
 *
 * @param app Pointer to application runtime context.
 * @return true if speed-error fault checks are active, false otherwise.
 */
static bool app_speed_error_fault_is_armed(const app_context_t *app)
{
	if (app == NULL) return false;
	if (app->alignment_done == false) return false;
	if (app->motor_h.status.has_valid_mechanical_speed == false) return false;
	if (app->current_speed_control_reference_mrpm !=
		app->speed_control_target_mechanical_speed_mrpm) return false;

	return true;
}

/**
 * @brief Stop runtime on large steady-state speed error.
 *
 * @param app Pointer to application runtime context.
 * @param now_ms Current runtime timestamp in milliseconds.
 */
static void app_check_speed_error_fault(app_context_t *app, uint32_t now_ms)
{
	int32_t speed_error_mrpm = 0;

	if (app == NULL) return;
	if (app_speed_error_fault_is_armed(app) == false) return;

	/* Keep the existing speed-error protection limit with one short UART fault line. */
	speed_error_mrpm = app->motor_h.speed_pi.speed_error_mrpm;
	if (app_abs_i32(speed_error_mrpm) > APP_MOTOR_TEST_FAULT_TRIGGER_ABS_SPEED_ERROR_MRPM)
	{
		printf("fault,%lu,%u\n",
			   (unsigned long)now_ms,
			   (unsigned)APP_FAULT_REASON_SPEED_ERROR_ABS_LIMIT);
		app_fatal_stop(app, "CTRL", "speed error limit");
	}
}

/**
 * @brief Initialize the application modules for the powered test.
 *
 * @param app Pointer to application runtime context.
 * @param motor_3pwm_cfg Pointer to motor 3PWM configuration.
 * @param motor_openloop_cfg Pointer to motor open-loop configuration.
 * @param motor_foc_voltage_cfg Pointer to motor FOC voltage configuration.
 * @param motor_electrical_angle_cfg Pointer to electrical-angle configuration.
 * @param motor_speed_feedback_cfg Pointer to speed-feedback configuration.
 * @param motor_speed_pi_cfg Pointer to speed-PI configuration.
 * @param motor_speed_reference_estimator_cfg Pointer to reference-estimator configuration.
 * @param as5600_analog_cfg Pointer to AS5600 analog configuration.
 */
static void app_init_modules(app_context_t *app,
							 const motor_3pwm_cfg_t *motor_3pwm_cfg,
							 const motor_openloop_cfg_t *motor_openloop_cfg,
							 const motor_foc_voltage_cfg_t *motor_foc_voltage_cfg,
							 const motor_electrical_angle_cfg_t *motor_electrical_angle_cfg,
							 const motor_speed_feedback_cfg_t *motor_speed_feedback_cfg,
							 const motor_speed_pi_cfg_t *motor_speed_pi_cfg,
							 const motor_speed_reference_estimator_cfg_t *motor_speed_reference_estimator_cfg,
							 const as5600_analog_cfg_t *as5600_analog_cfg)
{
	/* Initialize the board drivers before the application modules. */
	board_init();
	log_init(&USART2_H);

	/* Initialize the PWM power stage used by startup alignment and runtime FOC. */
	if (!motor_3pwm_init(&app->motor_3pwm_h, motor_3pwm_cfg))
	{
		app_fatal_trap("M3PWM", "init failed");
	}

	/* Initialize the open-loop helper used only for startup alignment actuation. */
	if (!motor_openloop_init(&app->motor_openloop_h, motor_openloop_cfg))
	{
		app_fatal_trap("MOPEN", "init failed");
	}

	/* Initialize the q-only voltage FOC kernel for post-alignment runtime tests. */
	if (!motor_foc_voltage_init(&app->motor_foc_voltage_h, motor_foc_voltage_cfg))
	{
		app_fatal_trap("MFOC", "init failed");
	}

	/* Initialize the measured electrical-angle helper for future sensored paths. */
	if (!motor_electrical_angle_init(&app->motor_electrical_angle_h, motor_electrical_angle_cfg))
	{
		app_fatal_trap("MEANG", "init failed");
	}

	/* Initialize the low-latency speed-feedback path used by active speed control. */
	if (!motor_speed_feedback_init(&app->motor_speed_feedback_h, motor_speed_feedback_cfg))
	{
		app_fatal_trap("MSPD", "init failed");
	}

