AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
	/* Initialize the active speed PI controller used by closed-loop runtime updates. */
	if (!motor_speed_pi_init(&app->motor_speed_pi_h, motor_speed_pi_cfg))
	{
		app_fatal_trap("MSPI", "init failed");
	}

	/* Initialize the reference speed-estimator baseline. */
	if (!motor_speed_reference_estimator_init(&app->motor_speed_reference_estimator_h,
											  motor_speed_reference_estimator_cfg))
	{
		app_fatal_trap("MEST", "init failed");
	}

	/* Initialize the AS5600 analog acquisition helper. */
	if (!as5600_analog_init(&app->as5600_analog_h, as5600_analog_cfg))
	{
		app_fatal_trap("AS5600", "init failed");
	}
}

/**
 * @brief Start the powered runtime from the startup alignment vector.
 *
 * @param app Pointer to application runtime context.
 * @param alignment_electrical_angle_u16 Startup electrical angle.
 */
static void app_start_motor_test(app_context_t *app, uint16_t alignment_electrical_angle_u16)
{
	/* Preload the startup alignment vector before PWM output starts. */
	if (!motor_openloop_apply(&app->motor_openloop_h, alignment_electrical_angle_u16))
	{
		app_fatal_trap("MOPEN", "alignment apply failed");
	}

	/* Start the PWM output before enabling the power stage. */
	if (!motor_3pwm_start(&app->motor_3pwm_h))
	{
		app_fatal_trap("M3PWM", "start failed");
	}

	/* Enable the motor power stage and seed the application timing markers. */
	gpio_write(MOTOR_EN.pin, true);
	app->motor_h.status.is_enabled = true;
	app->alignment_start_ms = SYSTICK_GetTimeMs();
	app->last_telemetry_ms = app->alignment_start_ms;
	app->last_actuation_update_ms = app->alignment_start_ms;
	app->last_speed_pi_update_ms = app->alignment_start_ms;
}

/**
 * @brief Update the application state from one consumed AS5600 angle sample.
 *
 * @param app Pointer to application runtime context.
 * @param published_sample Published AS5600 sample.
 * @param sample_consume_timestamp_us Current sample-consume timestamp.
 */
static void app_handle_consumed_angle_sample(app_context_t *app,
											 const as5600_analog_published_sample_t *published_sample,
											 uint64_t sample_consume_timestamp_us)
{
	uint16_t current_angle_u16 = 0u;

	if (published_sample == NULL)
	{
		app_fatal_stop(app, "AS5600", "sample null");
	}

	current_angle_u16 = published_sample->mechanical_angle_u16;

	/* Publish the latest sensor angle into the shared motor state. */
	app->motor_h.measurements.mechanical_angle_u16 = current_angle_u16;
	app->motor_h.status.has_valid_mechanical_angle = true;

	/* Convert the measured mechanical angle into measured electrical angle. */
	if (!motor_electrical_angle_update(&app->motor_electrical_angle_h, current_angle_u16))
	{
		app_fatal_stop(app, "MEANG", "update failed");
	}

	/* Feed the reference estimator with the current sample-consume timestamp. */
	if (!motor_speed_reference_estimator_update(&app->motor_speed_reference_estimator_h,
												current_angle_u16,
												sample_consume_timestamp_us))
	{
		app_fatal_stop(app, "MEST", "update failed");
	}

	/* Update the low-latency speed feedback using fixed publish cadence. */
	if (!motor_speed_feedback_update(&app->motor_speed_feedback_h, current_angle_u16))
	{
		app_fatal_stop(app, "MSPD", "update failed");
	}

	/* Keep the latest consumed sample for alignment and periodic telemetry. */
	app->latest_logged_mechanical_angle_u16 = current_angle_u16;
	app->latest_sample_valid = true;
}

/**
 * @brief Convert one full-turn uint16 angle into degrees x10 for telemetry.
 *
 * @param angle_u16 Angle in full-turn uint16 units.
 * @return Angle in tenths of degree.
 */
static uint16_t app_angle_u16_to_deg_x10(uint16_t angle_u16)
{
	/* deg_x10 = angle_u16 * 3600 / 65536, rounded to nearest. */
	uint32_t deg_x10_num = ((uint32_t)angle_u16 * 3600u) + 32768u;
	return (uint16_t)(deg_x10_num / 65536u);
}

/**
 * @brief Run one speed-controller update at fixed cadence.
 *
 * @param app Pointer to application runtime context.
 * @param speed_pi_update_period_ms PI update period in milliseconds.
 * @param now_ms Current time in milliseconds.
 */
static void app_update_speed_controller(app_context_t *app,
										uint16_t speed_pi_update_period_ms,
										uint32_t now_ms)
{
	if ((app->alignment_done == false) ||
		(app->motor_h.status.has_valid_mechanical_speed == false))
	{
		app->last_speed_pi_update_ms = now_ms;
		return;
	}

	/* Update closed-loop speed control in P-only mode (Ki=0 by config). */
	if ((now_ms - app->last_speed_pi_update_ms) >= speed_pi_update_period_ms)
	{
		/* First tuning profile: unidirectional trapezoid 0 -> peak -> 0, then repeat. */
		app_speed_profile_update(app, now_ms);

		/* Use the current profile reference for the active PI update. */
		if (!motor_speed_pi_update(&app->motor_speed_pi_h,
								   app->current_speed_control_reference_mrpm,
								   app->motor_h.measurements.measured_mechanical_speed_mrpm))
		{
			app_fatal_stop(app, "MSPI", "update failed");
		}

		app->last_speed_pi_update_ms += speed_pi_update_period_ms;
	}
}

/**
 * @brief Advance startup alignment and post-alignment closed-loop actuation.
 *
 * @param app Pointer to application runtime context.
 * @param actuation_update_period_ms Runtime actuation update period in milliseconds.
 * @param now_ms Current time in milliseconds.
 */
static void app_update_runtime_actuation(app_context_t *app,
										 uint16_t actuation_update_period_ms,
										 uint32_t now_ms)
{
	uint16_t raw_electrical_angle_u16 = 0u;
	uint16_t electrical_offset_u16 = 0u;

	/* Hold the alignment vector before phase progression starts. */
	if (app->alignment_done == false)
	{
		if ((now_ms - app->alignment_start_ms) >= APP_MOTOR_TEST_ALIGNMENT_DURATION_MS)
		{
			/* Wait for one valid consumed sensor sample before alignment calibration. */
			if (app->latest_sample_valid == false)
			{
				return;
			}

			/* Convert measured mechanical angle into raw electrical angle without offset. */
			if (!motor_electrical_angle_compute_raw(&app->motor_electrical_angle_h,
													app->latest_logged_mechanical_angle_u16,
													&raw_electrical_angle_u16))
			{
				app_fatal_stop(app, "MEANG", "raw angle failed");
			}

