AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
			/* offset = commanded_alignment_electrical - measured_raw_electrical. */
			electrical_offset_u16 =
					(uint16_t)(APP_MOTOR_TEST_ALIGNMENT_ELECTRICAL_ANGLE_U16 -
							  raw_electrical_angle_u16);
			if (!motor_electrical_angle_set_offset(&app->motor_electrical_angle_h, electrical_offset_u16))
			{
				app_fatal_stop(app, "MEANG", "offset set failed");
			}

			/* Publish the calibrated measured electrical angle from the same alignment sample. */
			if (!motor_electrical_angle_update(&app->motor_electrical_angle_h, app->latest_logged_mechanical_angle_u16))
			{
				app_fatal_stop(app, "MEANG", "aligned update failed");
			}

			/* Start q-only FOC runtime with zero Uq before first closed-loop update is applied. */
			if (!motor_speed_pi_reset(&app->motor_speed_pi_h))
			{
				app_fatal_stop(app, "MSPI", "reset failed");
			}
			/* Start the unidirectional tuning profile from the first zero-hold phase. */
			app_speed_profile_reset(app, now_ms);
			app->applied_uq_command_permyriad = 0u;
			app->alignment_done = true;
			app->last_actuation_update_ms = now_ms;
			app->last_speed_pi_update_ms = now_ms;
		}

		return;
	}

	/* After alignment, apply q-only sensored voltage actuation with controller-driven Uq. */
	if ((now_ms - app->last_actuation_update_ms) >= actuation_update_period_ms)
	{
		/* Use the current limited speed-controller output as the applied q-axis command. */
		app->applied_uq_command_permyriad =
				(int16_t)app->motor_h.speed_pi.speed_control_uq_command_permyriad;

		if (!motor_foc_voltage_apply_dq(&app->motor_foc_voltage_h,
										0,
										app->applied_uq_command_permyriad))
		{
			app_fatal_stop(app, "MFOC", "apply failed");
		}

		app->last_actuation_update_ms += actuation_update_period_ms;
	}
}

/**
 * @brief Emit one compact S-line telemetry record at fixed period.
 *
 * S-line fields:
 * S,timestamp_ms,mechanical_angle_deg_x10,velocity_filtered_mrpm,
 * velocity_target_final_mrpm,velocity_reference_mrpm,
 * velocity_error_mrpm,uq_command_permyriad
 *
 * velocity_target_final_mrpm reports the current profile phase target.
 * velocity_reference_mrpm reports the instantaneous reference fed to the controller.
 *
 * @param app Pointer to application runtime context.
 * @param now_ms Current time in milliseconds.
 */
static void app_emit_telemetry(app_context_t *app, uint32_t now_ms)
{
	uint16_t mechanical_angle_deg_x10 = 0u;
	int32_t velocity_target_final_mrpm = 0;
	int32_t velocity_reference_mrpm = 0;
	int32_t velocity_filtered_mrpm = 0;
	int32_t velocity_error_mrpm = 0;

	if (app == NULL) return;
	if (app->latest_sample_valid == false) return;
	if ((now_ms - app->last_telemetry_ms) < APP_MOTOR_TEST_TELEMETRY_PERIOD_MS) return;

	/* Build one compact S-line with current control and telemetry state. */
	mechanical_angle_deg_x10 =
			app_angle_u16_to_deg_x10(app->latest_logged_mechanical_angle_u16);
	/* Report phase target and instantaneous controller reference separately for clarity. */
	velocity_target_final_mrpm = app_speed_profile_phase_target_mrpm(app->speed_profile_phase);
	velocity_reference_mrpm = app->current_speed_control_reference_mrpm;
	velocity_filtered_mrpm = app->motor_h.speed_feedback.filtered_mechanical_speed_mrpm;
	velocity_error_mrpm = app->motor_h.speed_pi.speed_error_mrpm;

	printf("S,%lu,%u,%ld,%ld,%ld,%ld,%ld\n",
		   (unsigned long)now_ms,
		   (unsigned)mechanical_angle_deg_x10,
		   (long)velocity_filtered_mrpm,
		   (long)velocity_target_final_mrpm,
		   (long)velocity_reference_mrpm,
		   (long)velocity_error_mrpm,
		   (long)app->applied_uq_command_permyriad);
	app->last_telemetry_ms += APP_MOTOR_TEST_TELEMETRY_PERIOD_MS;
}

int main(void)
{
	app_context_t app = {0};
	as5600_analog_published_sample_t published_angle_sample = {0};
	const uint32_t speed_feedback_sample_period_us =
			APP_MOTOR_TEST_ANGLE_ADC_SAMPLE_PERIOD_US *
			(uint32_t)APP_MOTOR_TEST_ANGLE_PUBLISH_RAW_SAMPLE_COUNT;
	const motor_3pwm_cfg_t motor_3pwm_cfg = {
			.pwm_h = &PWM_H,
	};
	const motor_openloop_cfg_t motor_openloop_cfg = {
			.motor_h = &app.motor_h,
			.motor_3pwm_h = &app.motor_3pwm_h,
			.update_period_ms = APP_MOTOR_TEST_UPDATE_PERIOD_MS,
			.phase_increment_ramp_step_u32 = APP_MOTOR_TEST_STARTUP_OPENLOOP_PHASE_INCREMENT_RAMP_STEP_U32,
	};
	const motor_foc_voltage_cfg_t motor_foc_voltage_cfg = {
			.motor_h = &app.motor_h,
			.motor_3pwm_h = &app.motor_3pwm_h,
			.phase_sequence_sign = APP_MOTOR_TEST_PHASE_SEQUENCE_SIGN,
	};
	const motor_electrical_angle_cfg_t motor_electrical_angle_cfg = {
			.motor_h = &app.motor_h,
			.electrical_offset_u16 = 0u,
	};
	const motor_speed_feedback_cfg_t motor_speed_feedback_cfg = {
			.motor_h = &app.motor_h,
			.sample_period_us = speed_feedback_sample_period_us,
			.filter_time_constant_ms = APP_MOTOR_TEST_SPEED_FEEDBACK_FILTER_TIME_CONSTANT_MS,
			/* Keep control-direction sign separate from sensor and phase wiring signs. */
			.control_direction_sign = APP_MOTOR_TEST_CONTROL_DIRECTION_SIGN,
	};
	const motor_speed_pi_cfg_t motor_speed_pi_cfg = {
			.motor_h = &app.motor_h,
			.kp_q15 = APP_MOTOR_TEST_SPEED_PI_KP_Q15,
			.ki_per_s_q15 = APP_MOTOR_TEST_SPEED_PI_KI_PER_S_Q15,
			.update_period_ms = APP_MOTOR_TEST_SPEED_PI_UPDATE_PERIOD_MS,
			.output_limit_permyriad = APP_MOTOR_TEST_SPEED_PI_OUTPUT_LIMIT_PERMYRIAD,
	};
	const motor_speed_reference_estimator_cfg_t motor_speed_reference_estimator_cfg = {
			.motor_h = &app.motor_h,
			.history_sample_count = APP_MOTOR_TEST_SPEED_REFERENCE_ESTIMATOR_HISTORY_SAMPLE_COUNT,
	};
	const as5600_analog_cfg_t as5600_analog_cfg = {
			.adc_h = &ADC1_IN0_H,
			.adc_full_scale = (uint16_t)APP_MOTOR_TEST_AS5600_ADC_FULL_SCALE,
			.raw_sample_period_us = APP_MOTOR_TEST_ANGLE_ADC_SAMPLE_PERIOD_US,
			.raw_samples_per_publish = APP_MOTOR_TEST_ANGLE_PUBLISH_RAW_SAMPLE_COUNT,
			.wrap_correction_threshold_counts = (uint16_t)APP_MOTOR_TEST_ANGLE_HALF_TURN_COUNTS,
			.max_plausible_delta_per_publish_counts =
					(uint16_t)APP_MOTOR_TEST_ANGLE_MAX_PLAUSIBLE_DELTA_PER_PUBLISH_COUNTS,
			.mechanical_angle_direction = (APP_MOTOR_TEST_SENSOR_DIRECTION < 0) ?
					AS5600_ANALOG_DIRECTION_REVERSE :
					AS5600_ANALOG_DIRECTION_FORWARD,
	};
	app_init_context(&app);
	app_init_modules(&app,
					 &motor_3pwm_cfg,
					 &motor_openloop_cfg,
					 &motor_foc_voltage_cfg,
					 &motor_electrical_angle_cfg,
					 &motor_speed_feedback_cfg,
					 &motor_speed_pi_cfg,
					 &motor_speed_reference_estimator_cfg,
					 &as5600_analog_cfg);
	app_start_motor_test(&app, APP_MOTOR_TEST_ALIGNMENT_ELECTRICAL_ANGLE_U16);

	/* Loop forever */
	while(1)
	{
		uint32_t now_ms = SYSTICK_GetTimeMs();
		uint64_t now_us = SYSTICK_GetTimeUs();

		/* Service SysTick-driven AS5600 raw-sample scheduling. */
		if (!as5600_analog_service(&app.as5600_analog_h, now_us))
		{
			app_fatal_stop(&app, "AS5600", "update failed");
		}

		/* Consume one fixed-period published AS5600 mechanical-angle sample. */
		if (as5600_analog_consume_published_sample(&app.as5600_analog_h, &published_angle_sample))
		{
			app_handle_consumed_angle_sample(&app, &published_angle_sample, now_us);
		}

		/* Run closed-loop speed controller updates at fixed control cadence. */
		app_update_speed_controller(&app, APP_MOTOR_TEST_SPEED_PI_UPDATE_PERIOD_MS, now_ms);

		/* Keep speed-error protection active without verbose fault dump machinery. */
		app_check_speed_error_fault(&app, now_ms);

		/* Advance alignment and apply q-only FOC actuation with controller-driven Uq. */
		app_update_runtime_actuation(&app,
									 APP_MOTOR_TEST_UPDATE_PERIOD_MS,
									 now_ms);

		/* Emit lightweight runtime telemetry at fixed low rate. */
		app_emit_telemetry(&app, now_ms);
	}
}
